app/controllers/checklists_controller.rb

  def index

    if User.find_by_userID(session[:userID]).userType == "Student"
      @checklists = User.find_by_userID(session[:userID]).checklists
    else
      @checklists = Checklist.all
---
SELECT * FROM "users" WHERE ("users"."userID" = 'professor') LIMIT 1
SELECT * FROM "checklists" WHERE ("checklists"."user_id" IS NULL) LIMIT 1
SELECT * FROM "checklists"

  def show
    @checklist = Checklist.find(params[:id])
---
SELECT * FROM "checklists" WHERE ("checklists"."id" = 1)

  def edit
    @checklist = Checklist.find(params[:id])
---
SELECT * FROM "checklists" WHERE ("checklists"."id" = 2)

  def create
    @checklist = Checklist.new(params[:checklist])

    respond_to do |format|
      if @checklist.save
---
INSERT INTO "checklists" ("grade", "created_at", "studentID", "semester", "updated_at", "approved", "area", "count", "user_id", "year", "note", "courseCode") VALUES('A', '2011-05-14 03:12:06', '2222471', 'SP', '2011-05-14 03:12:06', 'Y', '1', 'Y', NULL, '2004', 'yes', 'CSCI4401')

  def destroy
    @checklist = Checklist.find(params[:id])
    @checklist.destroy
---
SELECT * FROM "checklists" WHERE ("checklists"."id" = 1)
DELETE FROM "checklists" WHERE "id" = 1