app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT * FROM "courses"

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 1)

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("created_at", "title", "updated_at", "level", "courseCode", "description") VALUES('2011-05-03 03:53:35', 'Unitary penis', '2011-05-03 03:53:35', '4', '2423423', 'sdlfkjasdf')

  def destroy
    @course = Course.find(params[:id])
    @course.destroy
---
SELECT * FROM "courses" WHERE ("courses"."id" = 2)
DELETE FROM "courses" WHERE "id" = 2