app/controllers/home_controller.rb

  def index
	@courses = Course.all
---
SELECT * FROM "courses"