app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."userID" IS NULL) LIMIT 1
---
   def index
    @users = User.all

SELECT * FROM "users" WHERE ("users"."userID" = '1111111') LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "updated_at", "lastname", "userType", "userID", "firstname", "password", "active") VALUES('2011-05-03 08:30:59', '2011-05-03 08:30:59', 'sdfg', '345345', 'sdg', 'erte', '3453', '35435')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 6)
UPDATE "users" SET "updated_at" = '2011-05-12 03:22:10', "userID" = 'JoshuaStudent' WHERE "id" = 6
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE (:userID = 'meebo') LIMIT 1
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy